In [3]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

c:\Users\Matheus\anaconda3\Lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [4]:
# Cria um dicionário em python
dados = {
    'Estado': ['Santa Cartarina', 'Rio de Janeiro', 'Tocantins', 'Bahia', 'Minas Gerais'],
    'Ano': [2004,2005,2006,2007,2008],
    'Taxa Desemprego' : [1.5,1.7,1.6,2.4,2.7]
}

In [5]:
for k,v in dados.items():
    print(k,v)

Estado ['Santa Cartarina', 'Rio de Janeiro', 'Tocantins', 'Bahia', 'Minas Gerais']
Ano [2004, 2005, 2006, 2007, 2008]
Taxa Desemprego [1.5, 1.7, 1.6, 2.4, 2.7]

In [6]:
df = pd.DataFrame(dados)

In [7]:
# Mostra 5 primeiras linhas 
df.head()

            Estado   Ano  Taxa Desemprego
0  Santa Cartarina  2004              1.5
1   Rio de Janeiro  2005              1.7
2        Tocantins  2006              1.6
3            Bahia  2007              2.4
4     Minas Gerais  2008              2.7

In [8]:
# Tipo do objeto criado
type(df)

pandas.core.frame.DataFrame

In [9]:
# Reorganizando as colunas
pd.DataFrame(dados, columns=['Ano', 'Estado','Taxa Desemprego'])

    Ano           Estado  Taxa Desemprego
0  2004  Santa Cartarina              1.5
1  2005   Rio de Janeiro              1.7
2  2006        Tocantins              1.6
3  2007            Bahia              2.4
4  2008     Minas Gerais              2.7

In [10]:
# Criando outro dataframe com os mesmos dados anteriores mas adicionando uma coluna 

df2 = pd.DataFrame(dados,
                   columns=['Estado', 'Taxa Desemprego', 'Taxa de Crescimento', 'Ano'],
                   index= ['estado1', 'estado2', 'estado3', 'estado4', 'estado5'])

In [11]:
df2.head()

                  Estado  Taxa Desemprego Taxa de Crescimento   Ano
estado1  Santa Cartarina              1.5                 NaN  2004
estado2   Rio de Janeiro              1.7                 NaN  2005
estado3        Tocantins              1.6                 NaN  2006
estado4            Bahia              2.4                 NaN  2007
estado5     Minas Gerais              2.7                 NaN  2008

In [12]:
# Retorna os valores do dataframe em um arry
df2.values

array([['Santa Cartarina', 1.5, nan, 2004],
       ['Rio de Janeiro', 1.7, nan, 2005],
       ['Tocantins', 1.6, nan, 2006],
       ['Bahia', 2.4, nan, 2007],
       ['Minas Gerais', 2.7, nan, 2008]], dtype=object)

In [13]:
# Tipo dos dados
df2.dtypes

Estado                  object
Taxa Desemprego        float64
Taxa de Crescimento     object
Ano                      int64
dtype: object

In [14]:
# Retorna o título das colunas em lista
df2.columns

Index(['Estado', 'Taxa Desemprego', 'Taxa de Crescimento', 'Ano'], dtype='object')

In [15]:
# imprimindo apenas uma coluna do dataframe
df2[['Estado', 'Taxa Desemprego']]

                  Estado  Taxa Desemprego
estado1  Santa Cartarina              1.5
estado2   Rio de Janeiro              1.7
estado3        Tocantins              1.6
estado4            Bahia              2.4
estado5     Minas Gerais              2.7

In [16]:
# Filtrando pelo índice
df2.filter(items=['estado3'], axis=0)

            Estado  Taxa Desemprego Taxa de Crescimento   Ano
estado3  Tocantins              1.6                 NaN  2006

In [17]:
df2.head()

                  Estado  Taxa Desemprego Taxa de Crescimento   Ano
estado1  Santa Cartarina              1.5                 NaN  2004
estado2   Rio de Janeiro              1.7                 NaN  2005
estado3        Tocantins              1.6                 NaN  2006
estado4            Bahia              2.4                 NaN  2007
estado5     Minas Gerais              2.7                 NaN  2008

## Usando Numpy e Pandas Para Manipulação de Dados

In [18]:
# Importando numpy
import numpy as np

In [19]:
df.head()

            Estado   Ano  Taxa Desemprego
0  Santa Cartarina  2004              1.5
1   Rio de Janeiro  2005              1.7
2        Tocantins  2006              1.6
3            Bahia  2007              2.4
4     Minas Gerais  2008              2.7

In [20]:
# mostra o formato das variáveis
df2.dtypes

Estado                  object
Taxa Desemprego        float64
Taxa de Crescimento     object
Ano                      int64
dtype: object

In [21]:
# resumo estatístico do Dataframe
df2.describe()
# Traz as medidas estatísticas de todas as variáveis numéricas

       Taxa Desemprego          Ano
count         5.000000     5.000000
mean          1.980000  2006.000000
std           0.535724     1.581139
min           1.500000  2004.000000
25%           1.600000  2005.000000
50%           1.700000  2006.000000
75%           2.400000  2007.000000
max           2.700000  2008.000000

In [22]:
# Retorna um dataframe com os valores ausentes das amostras = True
df2.isna()

         Estado  Taxa Desemprego  Taxa de Crescimento    Ano
estado1   False            False                 True  False
estado2   False            False                 True  False
estado3   False            False                 True  False
estado4   False            False                 True  False
estado5   False            False                 True  False

In [23]:
# Verificando filtrado por coluna
df2['Taxa de Crescimento'].isna()

estado1    True
estado2    True
estado3    True
estado4    True
estado5    True
Name: Taxa de Crescimento, dtype: bool

In [24]:
# Usando o Numpy para alimentar uma das colunas do dataframe
df2['Taxa de Crescimento'] = np.arange(5.)

In [25]:
df2.head()

                  Estado  Taxa Desemprego  Taxa de Crescimento   Ano
estado1  Santa Cartarina              1.5                  0.0  2004
estado2   Rio de Janeiro              1.7                  1.0  2005
estado3        Tocantins              1.6                  2.0  2006
estado4            Bahia              2.4                  3.0  2007
estado5     Minas Gerais              2.7                  4.0  2008

In [26]:
df2.dtypes

Estado                  object
Taxa Desemprego        float64
Taxa de Crescimento    float64
Ano                      int64
dtype: object

In [27]:
df2['Taxa de Crescimento'].isna()

estado1    False
estado2    False
estado3    False
estado4    False
estado5    False
Name: Taxa de Crescimento, dtype: bool

In [28]:
df2.describe()

       Taxa Desemprego  Taxa de Crescimento          Ano
count         5.000000             5.000000     5.000000
mean          1.980000             2.000000  2006.000000
std           0.535724             1.581139     1.581139
min           1.500000             0.000000  2004.000000
25%           1.600000             1.000000  2005.000000
50%           1.700000             2.000000  2006.000000
75%           2.400000             3.000000  2007.000000
max           2.700000             4.000000  2008.000000

## Slicing de DataFrames do Pandas

In [29]:
df2

                  Estado  Taxa Desemprego  Taxa de Crescimento   Ano
estado1  Santa Cartarina              1.5                  0.0  2004
estado2   Rio de Janeiro              1.7                  1.0  2005
estado3        Tocantins              1.6                  2.0  2006
estado4            Bahia              2.4                  3.0  2007
estado5     Minas Gerais              2.7                  4.0  2008

In [32]:
# Fatiando pelas observações (index)
df2['estado2': 'estado4']

                 Estado  Taxa Desemprego  Taxa de Crescimento   Ano
estado2  Rio de Janeiro              1.7                  1.0  2005
estado3       Tocantins              1.6                  2.0  2006
estado4           Bahia              2.4                  3.0  2007

In [33]:
# Fatiando o dataframe por uma condição lógica
df2[df2['Taxa Desemprego'] < 2]

                  Estado  Taxa Desemprego  Taxa de Crescimento   Ano
estado1  Santa Cartarina              1.5                  0.0  2004
estado2   Rio de Janeiro              1.7                  1.0  2005
estado3        Tocantins              1.6                  2.0  2006

In [35]:
# Fatiando o dataframe pelas colunas
df2[['Estado', 'Taxa de Crescimento']]

                  Estado  Taxa de Crescimento
estado1  Santa Cartarina                  0.0
estado2   Rio de Janeiro                  1.0
estado3        Tocantins                  2.0
estado4            Bahia                  3.0
estado5     Minas Gerais                  4.0

## Preenchimento de valores ausentes

A função fillna() é usada para preencher os valores ausentes. A função oferece muitas opções. Podemos usar um valor específico, uma função agregada (por exemplo, média()) ou valor anterior ou seguinte